#!/usr/bin/python
# -*- coding: utf-8  -*-
# Reza (User:reza1615)
#
# MIT license
# -*- coding: utf-8 -*-
# for calling this bot you can use  fa_cosmetic_changes(text,page) function
version=u'۳.۰'
import re,codecs,os, wikipedia,query,string
from datetime import timedelta,datetime
faSite = wikipedia.getSite('fa')
wikipedia.config.put_throttle = 0
wikipedia.put_throttle.setDelay()
bot_adress=u'/data/project/rezabot/'

correct_pages=[u'تپه شان کبود ۱۱۱',u'تپه شان کبود ۱',u'درست‌نویسي‌یِ خطِ فارسي',u'اندرو ام الن',u'بنیاد دایرةالمعارف اسلامی',u'میراندا جولای'
               ,u'جولای نقاب‌دار جنوبی',u'وی آر ام ال',u'اُ (سیریلیک)',u'فرودگاه مان',u'اً',u'دایرةالمعارف فارسی',u'ِ (سیریلیک)']

#-----------------
tags = ur'b|big|blockquote|charinsert|code|comment|del|div|em|gallery|hyperlink|i|includeonly|imagemap|inputbox|link|math|noinclude|nowiki|pre|ref|s|small|source|startspace|strong|sub|sup|template|timeline'
faChrs = u'ءاآأإئؤبپتثجچحخدذرزژسشصضطظعغفقکگلمنوهیيك'
langs = u'بلغاری|بنگالی|پارسی باستان|پارسی میانه|پالی|پرتغالی|پشتو|پنجابی|پین‌یینی|تاگالوگ|تامیلی|تاهیتی|تایلندی|ترکمنی|ترکی|ترکی استانبولی|ترکی آذربایجانی|تلگو|جاوه‌ای|چکی|چینی|چینی ساده‌شده|چینی سنتی|دانمارکی|دوناگری|روسی|رومانیایی|ژاپنی|سامی|سانسکریت|سریانی|سکایی|سواحلی|سواحیلی|سوندایی|سوئدی|سیسیلی|صربی|عبری|عربی|فارسی افغانستان|فارسی ایران|فارسی تاجیکی|فارسی سره|فرانسوی|فنلاندی|فیلیپینی|کاتالان|کردی|کره‌ای|کروات|کرواسی|گالیسی|گجراتی|گرجی|گرینلندی|لاتین|لتونیایی|لیتوانیایی|مازندرانی|مالایی|مالزیایی|مجاری|مراتی|مصری|مغولی|مقدونی|نپالی|نروژی|نروژی نو|نورمنی|هاوائی|هائیتیایی|هلندی|هندی|هواسایی|ولزی|ویتنامی|یونانی|یونانی باستان'
zaed = ur"''متن مورب''|'''متن ضخیم'''|\[\[پرونده:مثال\.jpg]]|=+ متن عنوان =+|:خط تو رفته\n?|<nowiki>اینجا متن قالب‌بندی‌نشده وارد شود</nowiki>|\# مورد فهرست شماره‌ای\n?|\* مورد فهرست گلوله‌ای|<sub>متن زیرنویس</sub>|<sup>متن بالانویس</sup>|<small>متن کوچک</small>|<big>متن بزرگ</big>|#(؟:تغییرمسیر|REDIRECT) \[\[(?:نام صفحه مقصد|نام صفحه)]]|\{\| class=\.wikitable\.\n\|-\n! متن عنوان !! متن عنوان !! متن عنوان\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|}|<gallery>\nپرونده:مثال\.jpg\|عنوان ۱\nپرونده:مثال.jpg\|عنوان ۲\n</gallery>|<ref>{{یادکرد\|نویسنده = \|عنوان = \| ناشر = \|صفحه = \|تاریخ = }}</ref>|<ref>{{یادکرد وب\|نویسنده = \|نشانی = \|عنوان = \| ناشر = \|تاریخ = \|تاریخ بازدید = }}</ref>|<ref>{{یادکرد خبر\|نام = \|نام خانوادگی = \|همکاران = \|پیوند = \|عنوان = \|اثر = \| ناشر = \|صفحه = \|تاریخ = \|بازیابی = }}</ref>|\[\[رده:]]|\[\[en:]]|\[\[fa:.*?]]|\[\[عنوان پیوند]]|\{\{\s*}}|\[\[\s*\|?\s*]]|<!-- *?-->|\'\'\'متن ضخیم'\'\'\|'\'متن مورب\'\'|\'\'\'متن پررنگ\'\'\'"#-----------------
bnMazi = u'[آا]راست|[آا]را?مید|[آا]زرد|[آا]زمود|[آا]سود|[آا]شامید|[آا]شفت|[آا]فرید|[آا]لا[یئ]ید|[آا]لود|[آا]ما[هس]ید|[آا]مد|[آا]مرزید|[آا]م[یو]خت|آورد|[آا][هو]یخت|[آا]غ[شس]ت|ارزید|افتاد|افراشت|ا?فروخت|افزود|افسرد|ا?فشاند|اف[کگ]ند|انجامید|اند[او]خت|اندیشید|ان[بگ]اشت|نگاشت|انگیخت|ایستاد|با[خف]ت|با[لر]ید|[شب]ایست|بخش[یو]د|برازید|ب[ور]د|[چبپ]رید|[رجشب]ست|بلعید|پ[وا]شید|پخت|پذیرفت|پرا[کگ]ند|پرداخت|پرست?ید|پرورد|پرید|پژمرد|پژوهید|پسندید|پنداشت|[بپ]و[سشی]ید|پیچید|پیراست|پیمود|پیوست|تا[فخ]ت|تپید|ترا[وش]ید|تر[سشک]ید|تکانی?د|تنید|توانست|جن[بگ]ید|[جد]وش?ید|چرخید|چسبید|چ[مکشر]?ید|خر[او]شید|خ[مرز]ید|خشکید|خوابید|خو?است|خواند|خورد|خیسید|داد|داشت|[مد]انست|درخشید|دزدید|دوخت|ربود|راند|ر[مس]ید|رو?فت|رنجید|رو[یئ]ید|ریخت|زد|زدود|زیست|س[وا]خت|سپرد|س[تر]ود|ستیزید|سرشت|سزید|سنجید|ش[تکگ]افت|شد|شک?ست|ش[کگ]فت|شمرد|شناخت|شنید|شورید|طلبید|غلطید|فرستاد|فر[مس]ود|فریفت|فشرد|فهمید|قبولاند|کا[سش]ت|کاوید|ک[نر]د|کشت|کشید|کو[چش]ید|کوفت|گداخت|گذا?شت|گرا[یئ]ید|گردید|گرفت|گروید|گری[خس]ت|گزارد|گزید|گس[تا]رد|گسست|گ[فش]ت|گشود|گماشت|گنجید|ل[رغ]زید|ما[لس]ید|ماند|مرد|نا[مل]ید|نشست|نکوهید|نگاشت|ن?گریست|نمود|نواخت|نوردید|نوشت|نهاد|نهفت|نی?وشید|ور?زید|هراسید|هلید|یازید|یافت'
bnMzare = u'[آا]را[یم]|[آا]زار|[آا]ماس|[آا]ز?مای|[آا]سای|[آا]شام|[آا]شوب|[آا]غا[رز]|[آا]فرین|[آا]گن|[آا]لای|[آا]ی|[آا]م[یور]ز|[آا]و?ر|[آا]ویز|[آا]هنج|ارز|افت|افر[او]ز|افزای|افسر|ا?فشان|اف[کگ]ن|انبار|انجام|اندا[یز]|اندوز|اندیش|ا?نگار|انگیز|اوبار|ایست|با[فلیشرز]|بخشای|بخش|براز|ب[َُ]?ر|بند|بساو|بسیج|بلع|بو[یس]?|بیز|پاش|پالای|پ[رز]|پذیر|پرا[کگ]ن|پرداز|پرست?|پرور|پژمر|پژوه|پسند|پلاس|پلک|پناه|پندار|پو[سشیک]|پیچ|پی[مر]ای|پیوند|تا[پز]|تو?پ|ترا[شو]|تر[سشک]|تکان|تن|توان|[نلجد]ه|جن[بگ]|جو[یش]?|چا[یپ]|چ[مکپشفر]|چر[خب]?|چسب?|چلان|چین|خا[یر]|خرا[مش]|خس[بت]|خشک|خروش|خ[ملرز]|خوا[نبه]|خو[فر]|خی[سز]|دا[نر]|درخش|درو?|دزد|[لد]م|دو[شز]?|ربای|ران|رخش|ر[سمه]|رو[یب]?|رشت|رقص|رنج|[بر]ی[نز]|زا[یر]|ز[ین]|زدای|ساز|سپا?ر|سپ؟وز|ستان|ستر|ستیز|سرای|سرشت|س[رز]|سنب|سگال|سنج|سای|شا[شی]|شتاب|شوی?|شک[او]ف|شکن|شکیب|ش[مو]ر|شناس|شنو|طلب|طوف|غارت|غرّ?|غلط|غنو|فرست|فر[سم]ای|فروش|فریب|فشر|فهم|قاپ|قبولان|کا[هرو]|ک[َُِ]?ش|ک[نف]|کو[چشب]|گای|گداز|گذا?ر|گرا[یز]|گرد|گیر|گرو|گریز?|گزار|گز|گزین|گس[تا]ر|گسی?ل|گشای|گو[یز]|گن[جد]|گ[مو]ار|ل[غر]ز|لن[گد]|لیس|ما[سلن]|میر|مک|مو[یل]|نا[زلم]|ن?شین|نکوه|نگا?ر|نمای|نواز|نورد|نویس|نهنب|نی?وش|ور?ز|هراس|هل|یا[برز]'
noAlef = u'باجی|بادانی?|بادی?|بار|باژور|بافت|با[لن]|بانگا[نه]|بتاب|بجی?|بچین|بخس[بت]|بخواره|بخور[دشی]?|بخوست|بخیز|بدارچی|بدارخانه|بدار[وکی]?|بدستان|بدستی?|بدندان|بدنگ|بده|بدیده|براهه?|برفت|برو[دن]|بریز|بریزگان|بزن|بز[یه]|بژ|بسال|بسالان|بست|بستره|بست[نه]|بسکون|بسه|بسوار|بشار|بشتگاه|بشتن?|بشخور|بش[نیش]|بشنگ|بغوره|بفت|بک|بکار|ب‌?کافت|بکا[نم]ه|بکش|بکشین|بکند|بکوهه|بکی|بگاه|بگرد|بگردان|بگز|بگوشت|بگون|بگیر|بگینه|بلوج|بنوس|بوند|بونمان|بونه|بیار|پارات|پارتاید|پارتمان|پاراتی|پاندیس|پاندیسیت|تربان|ترمه|تروپین|تریاد|تشبار|تشبان|تشپا|تشخوار|تشدان|تشفشان|تشک|تشکده|تشگاه|تش[هی]?|تشیزه|تشین|تلیه|ته|تورپات|تیه|ثار|ثام|جاردن|جان|جودان|جید[نه]|جیل|جین|چار|چاردن|چارکشی|چمز|حاد|خال|خت[نه]|خر|خرالامر|خرالزمان|خرت|خردست|خرزمان|خریا؟ن|خ[سش]مه|خشیج|خشیجان|خشیگ|خور|خورچرب|خورخشک|خورسنگین|خوندبازی|خوندک?|دا[بشک]|دامس|دخ|درس|درمه?|درنگ|دمک|دمیت|دمیرال|دمیزاد|دنیس|دیش|دیند?ه|ذار|ذری?|ذربایجانی?|ذربو|ذرجشن|ذرخش|ذریو?ن|ذوقه|ذین|را[یء]|راستن|راسته|رام|رامانیدن|رامش|رامگاه|رامی|رامیدن|رایش|رایشگاه|رایشگر|راییدن|رتروز|رتزین|رتیست|رتیشو|رخالق|ردبیز|رده|ردینه|رزم|رزو|رزوخواه|رزومندی?|رشه|رشیتکت|رشیو|رغ|رغده|رگون|رمان|رمان‌?شهر|رمیچر|رمید[هن]|رن|رنائوت|رنج|رنگ|رواره|روبند|روغ|ری|ریا|ریستوکرات|ریستوکراسی|ریغ|زادگان|زادگی|زادمرد|زاد[یه]?|زادوار|زادی‌?خواه|زار|زارتلخه|زا?رد[نه]|زارنده|زاریدن|زال|زجوی|زخ|زدن|زرد|زردگی|زرم|زرمجو|زرمگین|زری|زغ|زفنداک|زگار|زما|زمایش|زمایشگاه|زماینده|زمایه|زمندی?|زمودگی|زمود[نه]|زمون|زناک|زور|زوغ|زوقه|زیدن|زیر|ژان|ژانس|ژخ|ژدار|ژده|ژغ|ژفنداک|ژگن|ژن[دگ]|ژندن|ژندیدن|ژیانه|ژید[نه]|ژیر|ژیرنده|ژیریدن|ژینه|سان|سانسور|سانی|سایش|سایشگاه|ساینده|ساییدن|سبان|سپیرین|ستانه|ستر|ستیگماتیسم|ستی[من]ه?|سدست|سغده|سفالت|سکاریس|سمانخانه|سمانخراش|سمان[هی]?|سموغ|سه|سودگی|سود[نه]|سیابان|سیاچرخ|سیازنه|سیاکردن|سیا[وب]?|سیایی|سیب|سیل|سی[من]ه|سیون|شا[بم]|شامیدن|شانه|شپز|شپزخانه|شتالنگ|شت[می]|شخال|شخانه|شردن|شرمه|شفتگی|شفت[نه]?|شکار|شکارساز|شکاره|شکوبه|شکو[بخ]?|شکوخیدن|شگر|شمالی?|شموغ|شنا|شناگر|شنا[هو]|شناوری|شنایی|شوب|شوب‌?گر|شوبیدن?|شور|شوردن|شوریده|شوغ|شوفتن|شیانه|شیهه|صال|غُش|غا|غاجی|غار|غاردن|غاری|غاریدن|غازگر|غاز[هی]?|غازیدن|غالش?|غالنده|غالید[نه]|غچه|غردن|غری?|غز|غ[سش]ت[نه]|غل|غندن|غنده|غو[زشل]|غوشیدن|غیل|فا[تق]|فاقی|فتاب[هی]?|فتومات|فدم|فرنگ|فروشه|فریدگار|فرید[نه]|فرین|فرینگان|فریننده|فگانه|فل|فند|فندیدن|فیش|ق|قا|قازاده|قاسی|ق‌?بانو|قچه|قسنقر|قشام|قطی|قورایی|قوش|کادمیک?|کاردئون|کام|ک[بپج]|کبند|کتریس|کتور|کروبات|کروباسی|کستن|ککرا|کله|کند[نه]|کنش|کنه|کنیدن|کواریوم|کوستیک|کولاد|کومولاتور|گاهاندن|گاهی?|گ[پج]|گراندیسمان|گرمان|گشتن|گفت|گنج|گنده|گهی|گو|گور|گورگر|گو[شن]|گیشیدن|گی[من]|لاپلنگی|لات|لاچیق|لاخون|لاس|لاسکا|لاگارسون|لامد?|لاوه?|لایش|لاییدن|لبالو|لبوم|لبومین|لپر|لت|لترناتیو|لر|لرژی|ل[شغ]|لغده|لفا|لفت[نه]|لکالویید|لگرو|لگونه|لوچه|لودگی|لود[نه]|لوسن|لومین|لومینیوم|لو[ئن]ک|لیاژ|لیداد|لیزیدن|ماتور|ماج|ماجگاه|مادگی|ماده|مار|مارگر|ماریدن|ماریلیس|ماس|ماسانیدن|ماسیدن|ماق|مال|مانی|ماهانیدن|ماهیدن|مبولانس|مپر|مپرسنج|مپلی|مپول|مپی|مخته|مدگان|مدن?|مرانه|مرزش|مرزگار|مرزنده|مرزیدن|مرزیده|مرغ|مریکا|مریکایی?|مفی|مفیبول|مه|موت|موخت[نه]|مود[نه]|موزانه|موزشی?|موزشیار|موزگا[رن]|موزنده|موزه|موق|موکسی|مولن|مون|مونیاک|میب|میختگی|میخت[نه]|میز[شه]?|میزگاری?|میغه?|نابولیسم|نات?|ناتومی|نارشی|نارشیس[تم]ی?|ناس|نالوگ|نالیز|نام|ناناس|نتراکت|نتریک|نت[نی]|نتیک|نجا|نچت?|ندوتوکسین|ندودرم|ندوسپرم|ندوسکوپی|ندون|نرمال|نزیم|نژین|نژیوکت|نژیوگرافی|نسه|نسیلین|نک|نگلوفیل|نوریسم|نیلین|نین|نیه|نیون|هار|هاردن|هازیدن|هستگی|هسته|هک|همند|هنج|هنجیدن|هنگ[ری]?|هنگساز|هنین|هو|هوانگیز|هوپا|هوتک|هوچشم|هودل|هوفغند|هومند|هون|هیانه|هیختن|واخ|وارگی|وا[رز]ه?|واشناسی|واکس|وام|وانتاژ|وانس|وانگارد|وانویسی|وردجو|وردگا؟ه|وردن|وردیدن|ورک|ورنجن|وری|وریدن|وریل|ونگ|ونگان|ونگون|ویخت[نه]|ویزش?|ویزگ?ان|وی[زژ]ه|ویزون|ویشن|یا[تن]?|یبک|یتم?|یزنه|یژ|یفت|یفون|ینده|یه|ییژ|یین|[یئ]?ینه|ئورت'
tnvindar = u'(الزاما|لزوما|یقینا|قطعا|حتما|قاعدتا|طبیعتا|طبعا|قهرا|جدّا|حقیقتا|واقعا|مطمئنا|واضحا|مسلما|تماما|کاملا|عینا|اکیدا|مطلقا|دقیقا|مستقیما|اصولا|اصلا|اصالتا|نسبا|نسبتا|تقریبا|حدودا|معمولا|عرفا|قانونا|شرعا|اخلاقا|خلقا|احتمالا|استثنائا|اساسا|کلّ?ا|جزئا|مجموعا|جمعا|اجماعا|شدیدا|نهایتا|اقلا|اکثرا|غالبا|عمدتا|ندرتا|بعضا|گاها|صریحا|صراحتا|عموما|اختصاصا|خصوصا|مجملا|اجمالا|اختصارا|مختصرا|مشروحا|ظاهرا|باطنا|عمیقا|ذاتا|فطرتا|روحا|جسما|ابتدائا|مقدمتا|بدوا|بعدا|قبلا|جدیدا|سابقا|اخیرا|ابدا|عمرا|تلویحا|علنا|حضورا|غیابا|نیابتا|لطفا|اجبارا|اختیارا|عالما|عمدا|عامدا|تعمدا|متعمدا|عادتا|مستقلا|احتیاطا|احیانا|غفلتا|سهوا|اشتباها|عاجلا|عجالتا|مرتجلا|ارتجالا|سریعا|فورا|دا[یئ]ما|ضرورتا|نقدا|منحصرا|صرفا|دفعتا|کرارا|مکررا|مجددا|مرتبا|مستمرا|متواترا|تدریجا|تصادفا|عملا|فعلا|موقتا|ضمنا|نتیجتا|نوعا|اصطلاحا|جسارتا|بالا ?غیرتا|م[وؤ]کدا|ذیلا|شخصا|مشترکا|مفصلا|رسما|ترجیحا|قلبا|ر[اأ]سا|تو[اأ]ما|متناوبا|متوالیا|متقابلا|متعاقبا|متّ?فقا|مثلا|فرضا|ایضا|مضافا|مصرّ?ا|ارفاقا|انصافا|جهارا|طولا|متدرجا|غانما|احتراما|ناچارا|سفارشا|تلفنا|زبانا|کتبا|شفاها|اولا|سوما|چهارما|ثانیا|ثالثا|رابعا|خامسا|سادسا|سابعا|ثامنا|تاسعا|عاشرا)'#اکساندر دوما!
sametH = ur'فرمانده|زره|کوه|گره|گنه|سپه|مکروه|م?ت?وجّ?ه|منزّ?ه|نزه|ابله|مرفّ?ه|شبیه|مت?شابه|کریه|پادشه|اللّ?ه|اله|[آکبتدرزشلم]ه' #e: صامت هـ
spcBfre = u'.،,:؛;؟٫)}]»》”，·。一ｰ・、：（）「」〜？！ء'
spcAftr = u'({[«《“，·。一ｰ٫・、：（）「」〜？！'
bLA = u'(?!['+faChrs+u'])'
bLB = u'(?<!['+faChrs+u'])'
def entofa_num (txt):
    try:
       txt=str(txt)
    except:
       pass
    count=0
    for i in u'۰۱۲۳۴۵۶۷۸۹':
       txt=txt.replace(str(count),i)
       count+=1
    txt=txt.replace(u',',u'،')
    return txt

def minor_edits (text):
    #تمیزکاری فاصلهٔ مجازی
    text = re.sub(u'‌{2,}', u'‌', text) # پشت‌سرهم
    text = re.sub(u'\[\[([^\]\|]*?)‌]](%s+)' % faChrs, ur'[[\1|\1‌\2]]', text) # Piping
    text = re.sub(u'‌(?![ئاآأإژزرذدوؤةب\(\)پتثجچحخسشصضطظعغفقک،گلمنهیيًٌٍَُِّْٰ\[\]ٓٔ]|[\u0900-\u097F]|ֹ)', '', text) # در پس
    text = re.sub(u'(?<![ئبپتثجچح\[\]خسشصضطظعغ\(\)فقکگلم،نهیيًٌٍَُِّْٰٓٔ]|[\u0900-\u097F]|f|ֹ)‌', '', text) # در پیش
    return text

def arabic_to_farsi(text):
    text = re.sub(u'[كﮑﮐﮏﮎﻜﻛﻚﻙ]', u'ک', text)
    text = re.sub(ur'[ىىىېىﻴﻲﻳﻲۍﻱﻰىىﻯي]', u'ی', text)
    text = re.sub(ur'[ہەھ]', u'ه', text)
    text = re.sub(ur'[ًٌٍَُِّْ]', u'', text)
    count=-1
    fanum=u"۰۱۲۳۴۵۶۷۸۹"
    arnum=u"٠١٢٣٤٥٦٧٨٩"
    for i in arnum:
        count+=1
        text=text.replace(arnum[count],fanum[count])

    return text

def dictation(txt):
    #s: شبه‌ساده‌ها  ####### مشارٌ‌اليه، مضاف‌ٌاليه، منقولٌ‌عنه، مختلفٌ‌فيه، متفق‌ٌعليه، بعبارةٍاُخرى، اباًعن‌جدٍ، اىّ‌نحوٍكان.
    txt = re.sub(bLB+u'من ?(باب|جمله)'+bLA, ur'من‌\1', txt)
    txt = re.sub(u' مع ?(هذا|ذلک|الفار[غق]|الوصف|ال[اأ]سف)', ur' مع‌\1', txt)
    txt = re.sub(u' علی ?(هذا|حده|رغم|الاصول|الحساب|الخصوص|البدل|الدوام|السویه|الطلوع|الله|القاعده)', ur' علی‌\1', txt)
    txt = re.sub(bLB+u' ذو ال', u' ذوال', txt)
    txt = re.sub(u' ذی ?(ال|نفع|امر|جود|حساب|حق|حیات|ربط|روح|شعور|صلاح|صلاحیّ?ت|عقل|علاقه|فقار|فن|قیمت|نفوذ)'+bLA, ur' ذی‌\1', txt)
    txt = re.sub(bLB+u' حقّ? (?=البوق|العبور|الت[اأ]لیف|التدریس|الزحمه|اللّ?ه|النّ?اس|تعالی)', u' حق‌', txt)
    txt = re.sub(u' عن ?[قغ]ریب', u' عن‌قریب', txt)
    txt = re.sub(u' قتل ?عام', u' قتل‌عام', txt)
    txt = re.sub(u' علی[‌ ][اأ]یّ?[‌ ]?حال', u' علی‌أی‌حال', txt)
    txt = re.sub(u' من[‌ ]?حیث[‌ ]?المجموع', u' من‌حیث‌المجموع', txt)
    txt = re.sub(u'ب(?:|ه[‌ ])ر[اأ]ی[‌ ]العین', u'برأی‌العین', txt)
    txt = re.sub(u'ما ?ب(?:|ه[‌ ])ازا', u'مابازا', txt)
    txt = re.sub(u'متقابل[‌ ](?:ب|به[‌ ])ر[اأ]س', u'متقابل‌به‌رأس', txt)
    txt = re.sub(u'منحصر ?(?:ب|به[‌ ])فرد', u'منحصربه‌فرد', txt)
    txt = re.sub(bLB+u'فی[‌ ]?ما ?بین', u'فی‌مابین', txt)
    txt = re.sub(u' [اآ]ی[ةت][‌ ]?اللّ?ه', u' آیت‌الله', txt)#عنایت‌الله
    txt = re.sub(u'حج[ةته][‌ ]?ال[اإ]سلام', u'حجت‌الاسلام', txt)
    txt = re.sub(u'ثق[ةته][‌ ]?ال[اإ]سلام', u'ثقةالاسلام', txt)
    txt = re.sub(u'امیر ?الم[وؤ]منین', u'امیرالمؤمنین', txt)
    txt = re.sub(u'(متوازی|مختلف)[‌ ]?ال[اأ]ضلاع', ur'\1‌الأضلاع', txt)
    txt = re.sub(u'متساوی[‌ ]?السّ?اقین', u'متساوی‌الساقین', txt)
    txt = re.sub(u'قا[یئ]م[‌ ]الزّاوی[ةه]', u'قائم‌الزاویه', txt)
    txt = re.sub(u'دا[یئ]ر[ةته][‌ ]?(البروج|المعارف|العلوم)', ur'دائرة\1', txt)
    txt = re.sub(u'دا[یئ]م[‌ ](الخمر|الصوم|الذّ?[کك]ر)', ur'دائم‌\1', txt)
    txt = re.sub(u'ر[اأإ]س[‌ ](الجدی|السّ?رطان|المال)', ur'رأس‌\1', txt)
    txt = re.sub(u'(مجنی|مجنی)[‌ ][عا]لیه', ur'\1‌علیه', txt)
    txt = re.sub(u'(مضاف|مسند|مرجوع|مشار|منتقل)ٌ?[‌ ]?[عا]لیه', ur'\1ٌ‌الیه', txt)
    txt = re.sub(u'منته[ای][‌ ]?[عا]لیه', u'منتهی‌الیه', txt)
    txt = txt.replace(u'بین الملل', u'بین‌الملل').replace(u'نرم افزار', u'نرم‌افزار').replace(u'حزب الل', u'حزب‌الل')
    txt = txt.replace(u'جدید الاحداث', u'جدیدالاحداث').replace(u'کثیر الانتشار', u'کثیرالانتشار').replace(u'سریع السیر', u'سریع‌السیر')
    txt = txt.replace(u'لازم الاجرا', u'لازم‌الاجرا').replace(u'فوق الذکر', u'فوق‌الذکر').replace(u'مرضی الطرف', u'مرضی‌الطرف')
    txt = txt.replace(u'خاتم الانبیا', u'خاتم‌الانبیا').replace(u'متفق القول', u'متفق‌القول').replace(u'قریب الوقوع', u'قریب‌الوقوع')
    txt = txt.replace(u'سوق الجیشی', u'سوق‌الجیشی').replace(u'محیر العق', u'محیرالعق').replace(u'عظیم الجث', u'عظیم‌الجث')
    txt = txt.replace(u'لطایف الحیل', u'لطایف‌الحیل').replace(u'موقوف المعانی', u'موقوف‌المعانی').replace(u'سلیم النفس', u'سلیم‌النفس')
    txt = txt.replace(u'موثق الصدور', u'موثق‌الصدور').replace(u'شمس العمار', u'شمس‌العمار').replace(u'حسب الامر', u'حسب‌الامر')
    txt = txt.replace(u'مسلوب الاراده', u'مسلوب‌الاراده').replace(u'مستجاب الدعو', u'مستجاب‌الدعو')
    txt = re.sub(bLB+u'(دار|مشترک|ممنوع|قدیم|قلیل|ناقص|ضعیف|قوی|تحت|ر[یئ]یس|ربّ?|امّ?|حقّ?|ماء|ماوراء|باب) (?=ال)', ur'\1‌', txt)
   #txt = re.sub(u'‌(?=الهام|الصاق|الزام|القا|الکتریک|الکتریسیته)', u'', txt)
    txt = txt.replace(u'برپایه', u'بر پایه')
    #e: اً
    txt = re.sub(bLB+tnvindar+bLA, ur'\1ً', txt)
    txt = re.sub(u'اصلاً? ?و ?ابداً?', u'اصلا و ابدا', txt)
    txt = re.sub(u'اهلاً? ?و ?سهلاً?', u'اهلاً وسهلاً', txt)
    txt=txt.replace(u'ًً',u'ً')# remove double tanvin!

    #e: آ
    #txt = re.sub(bLB+u'(ا|أ)('+noAlef+u')'+bLA, ur"آ\2", txt)#it has some bugs!
    txt = txt.replace(u' راکتور', u' رآکتور').replace(u'فرآیند', u'فرایند').replace(u'فرآورده', u'فراورده')# e: ا <-> آ
    txt = re.sub(bLB+u'ایده?[‌ ][اآ]ل', u'ایده‌آل', txt)
    #s: افعال
    txt = txt.replace(u' دو میدانی ', u' دومیدانی ')
    txt = re.sub(bLB+u'(نمی) ?([نب]ی؟|)('+bnMzare+u'|'+bnMazi+u')(ان|)(م|ی|د|یم|ید|ا?ند)'+bLA, ur'\1‌\2\3\4\5', txt) # می bug همیاری
    #txt = re.sub(bLB+u'(باز|فر[او]|وا|[بد]ر) ?([هن]?می‌|)([منب]ی?|)('+bnMzare+u'|'+bnMazi+u')(م|ی|د|یم|ید|ا?ند)'+bLA, ur'\1\2\3\4\5', txt) # پیشوند فعل ### BUG
    txt = re.sub(bLB+u'(باز|فر[او]|وا|بر) ?([منب]ی?|)('+bnMazi+u')ن'+bLA, ur'\1\2\3ن', txt)#وی در جنگیدن با من
    txt = re.sub(bLB+u'('+bnMazi+u')ه (ام|ای|ایم|اید|اند)'+bLA, ur'\1ه‌\2', txt) # فم بین «ه» و شناسه طبق شیوه‌نامه است باید جدا باشد
    txt = re.sub(u'([منب])یا(رزید|فتاد|فتد|فراشت|فروخت|فزود|فسرد|فشاند|ف[کگ]ند|نجامید|ند[او]خت|ندیشید|ن[بگ]اشت|نگیخت)(م|ی|یم|ید|ند|[^'+faChrs+u'])', ur'\1ی\2', txt) # نیافتاد -> نیفتاد
    txt = re.sub(u'([منب])یا(رز|فر[او]ز|فزای|فسر|فشان|ف[کگ]ن|نبار|نجام|ندا[یز]|ندوز|ندیش|نگار|نگیز)(م|ی|د|یم|ید|ا?ند|[^'+faChrs+u'])', ur'\1ی\2\3', txt) # بیاندیش -> بیندیش

    #s: ضمایر ملکی
    txt = re.sub(u'(?:ه|هٔ)[‌ ](مان|شان)'+bLA, ur'ه‌\1', txt)#BUG:Solved
    txt = re.sub(u'(?<=ه)[‌ ](ات|اش)'+bLA, ur'‌\1', txt)

    #s: و
    txt = re.sub(u'رفت[‌ ]?و ?[اآ]مد', u'رفت‌وآمد', txt)
    txt = re.sub(u'گفت[‌ ]?و ?گو', u'گفتگو', txt)
    txt = re.sub(u'جست[‌ ]?و ?جو', u'جستجو', txt)
    txt = re.sub(u'پخت[‌ ]?و ?پز', u'پخت‌وپز', txt)
    txt = re.sub(u'شست[‌ ]?و ?شو', u'شست‌وشو', txt)
    txt = re.sub(u'خفت[‌ ]?و ?خیز', u'خفت‌وخیز', txt)
    txt = re.sub(bLB+u'کند ?و ?کا?و'+bLA, u'کندوکاو', txt)
    txt = re.sub(bLB+u'کم[‌ ]و ?کاست', u'کم‌وکاست', txt)

    #s: بسیط
    txt = re.sub(u'(فن|دل)ّ?[‌ ]?[آا]وری', ur'\1اوری', txt)
    txt = re.sub(bLB+u' دل[‌ ](سوزی|تنگی|بری) '+bLA, ur' دل\1 ', txt)#Bug دل بریدن
    txt = re.sub(bLB+u'یک[‌ ]دلی'+bLA, u'یکدلی', txt)
    txt = re.sub(u'گاه[‌ ]و ?بی[‌ ]?گاه', u'گاه‌و‌بیگاه', txt)

    #e: دیگر غلط‌های املایی
    txt = re.sub(u' (سپاس|شکر|بر)[‌ ]?گ[ذز]ار ', ur' \1‌گزار ', txt)#بنا بر گزارش
    txt = re.sub(u'(پایه|بنیان)[‌ ]?گزار', ur'\1‌گذار', txt)#متغییر الگو بنیانگذار
    txt = re.sub(bLB+u'بی[‌ ]?م[حه]ابا', u'بی‌محابا', txt)
    txt = re.sub(bLB+u' بر ?خو?است', u' برخاست', txt)
    txt = re.sub(u'خوانواد(?=ه|گی)', u'خانواد', txt)
    txt = re.sub(u'[آا]نفو?لو? ?[آا]نزا', u'آنفلوآنزا', txt)
    txt = re.sub(bLB+u'غری[ضظ]ه'+bLA, u'غریزه', txt)
    txt = txt.replace(u'خواستگاه', u'خاستگاه')
    txt = txt.replace(u'باطری', u'باتری').replace(u'باطلاق', u'باتلاق').replace(u' ملیون', u' میلیون')
    txt = txt.replace(u'ضمینه', u'زمینه').replace(u'انظباط', u'انضباط').replace(u'حاظر', u'حاضر')
    #txt = txt.replace(u'نفوظ', u'نفوذ') ###
    txt = txt.replace(u'مذبور', u'مزبور').replace(u'قائله', u'غائله').replace(u' وحله', u' وهله').replace(u' مرهمت', u' مرحمت')
    txt = txt.replace(u' انهنا', u' انحنا').replace(u'پزشگی', u'پزشکی').replace(u'تضاهرات', u'تظاهرات')
    txt = txt.replace(u'تلوزیون', u'تلویزیون').replace(u'پرفسور', u'پروفسور').replace(u' خوشنود', u' خشنود')
    txt = txt.replace(u' الویت', u' اولویت').replace(u'ملیارد', u'میلیارد')
    txt = txt.replace(u'شگفت انگیز', u'شگفت‌انگیز')
    txt = re.sub(u'ه‌(گی|گانی?)'+bLA, ur'\1', txt)
    #txt = re.sub(bLB+u'وب[‌ ]?(سایت|گاه)', u'وبگاه', txt) ###in many cases it could be template vaiable!
    txt = re.sub(u'ویکی ?(?=سازی|فا |[مپ]دیا)', u'ویکی‌', txt)
    txt = re.sub(u'ویکی‌پدیا ?(?='+langs+u')', u'ویکی‌پدیای ', txt)
    txt = re.sub(u'علاقه?[‌ ]?مند', u'علاقه‌مند', txt)
    txt = re.sub(u'باقی ?ماند', u'باقی‌ماند', txt)
    txt = re.sub(u'مت[عاأ][سص]ّ?فانه', u'متأسفانه', txt)

    txt = re.sub(bLB+u'من[‌ ]را'+bLA, u'مرا', txt)
    #txt = re.sub(u'عدم وجود'+bLA, u'نبودِ', txt)
    #txt = txt.replace(u'عدم حضور', u'غیاب')
    txt = re.sub(u'اقدامات لازمه?'+bLA, u'اقدام‌های لازم', txt)

    #e: ماه‌ها
    txt = re.sub(bLB+u'(?:جولای|ژوییه)'+bLA, u'ژوئیه', txt)
    #txt = re.sub(bLB+u'[اآ]گوست'+bLA, u'اوت', txt)#جین آگوست دومینیک
    txt = re.sub(bLB+u'دی?سا?مبر'+bLA, u'دسامبر', txt)
    txt = re.sub(u'(ربیع|جمادی)[‌ ]?(?:الثانی|ال[اأإ]خر)', ur'\1‌الثانی', txt)
    txt = re.sub(u'(ربیع|جمادی)[‌ ]?ال[اأإ]ول', ur'\1‌الاول', txt)
    #txt = re.sub(u'ذ[وی][‌ ]?(?:ال|)(حج|قعد)[ةه]', ur'ذی‌ال\1ه', txt) ###

    #e: جمع‌الجمع
    txt = re.sub(u'(مدارک)[‌ ]?های?'+bLA, u'مدارک', txt)
    txt = re.sub(bLB+u'رسومات'+bLA, u'رسوم', txt)


    #e: حشو
    txt = re.sub(bLB+u'بر ?علیه', u'علیه', txt) # بر علیه
    txt = re.sub(u'اعلم[‌ ]?تر', u'اعلم', txt) # تر

    #e: طبق قاعدهٔ فارسی
    txt = re.sub(u'(آزمایش|پژوهش|پیشنهاد|نمایش|دستور|فرمایش|گزارش|گرایش|باغ|کوهستان)اتی ', ur'\1‌هایی ', txt) # اتی -> هایی
    txt = txt.replace(u'بازرسین', u'بازرسان').replace(u'داوطلبین', u'داوطلبان') #e: ین -> ان
    txt = txt.replace(u'زباناً', u'زبانی').replace(u'تلفناً', u'تلفنی').replace(u'ناچاراً', u'به‌ناچار').replace(u'گاهاً', u'گاهی') #e: اً
    #--------------------------Reza added------------------------
    return txt.strip()

def cleaning(text):
    text=text.replace(u'\r',u'').replace(u'\n^ "',u'\n*"').replace(u'&zwnj;',u'‌').replace(u'\n \n \n',u'\n\n').replace(u'\n \n',u'\n\n').replace(u'\n \n',u'\n\n').replace(u'\n  \n',u'\n\n')
    text=text.replace(u'< ',u'<').replace(u' >',u'>').replace(u'<!--\n',u'<!--').replace(u'\n-->',u'-->').replace(u'<!---\n',u'<!---').replace(u'\n--->',u'--->')
    #تمیزکاری فاصلهٔ مجازی
    text = re.sub(u'‌{2,}', u'‌', text) # پشت‌سرهم
    text = re.sub(u'\[\[([^\]\|]*?)‌]](%s+)' % faChrs, ur'[[\1|\1‌\2]]', text) # Piping
    text = re.sub(u'‌(?![ئاآأإژزرذدوؤةبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔ]|[\u0900-\u097F]|ֹ)', '', text) # در پس
    text = re.sub(u'(?<![ئبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔ]|[\u0900-\u097F]|f|ֹ)‌', '', text) # در پیش
    text=arabic_to_farsi(text)
    text=minor_edits (text)
    text = re.sub(u"(?:"+zaed+u")", "", text)
    return text

def redirect_find( page_link):
    page_link=page_link.replace(u' ',u'_')
    params = {
        'action': 'query',
        'redirects':"",
        'titles': page_link
    }
    query_page = query.GetData(params,faSite)
    try:
        redirect_link=query_page[u'query'][u'redirects'][0]['to']
        return True
    except:
        if 'missing=""' in str(query_page):
            return True
        else:
            return False

def Check_Page_Exists(page_link):
    page_link=page_link.replace(u' ',u'_')

    params = {
        'action': 'query',
        'prop':'info',
        'titles': page_link
    }
    query_page = query.GetData(params,faSite)
    try:
        for i in query_page[u'query'][u'pages']:
            redirect_link=query_page[u'query'][u'pages'][i]['pageid']
            return False# page existed
    except:
        return True# page not existed

def JS_Extratools(text):
    JSFile=bot_adress+u'fa_bot.js'
    BotResultFile=bot_adress+u'bot_result.txt'
    with codecs.open(BotResultFile ,mode = 'w',encoding = 'utf8' ) as f:
        f.write(u'')
    with codecs.open(bot_adress+u"bot_input.txt" ,mode = 'w',encoding = 'utf8' ) as f:
                                f.write(text)
    JSLib = codecs.open(bot_adress+u"JSLib.js",'r' ,'utf8' )
    JSLib = JSLib.read()
    JSLib = re.sub(ur'mw\.config\.get\(.*?\)', u'0', JSLib)
    JSLib=JSLib.replace(u"mw.config.get('wgNamespaceNumber')",u'0')

    JSLib+=u"\nvar fs = require('fs');"
    JSLib+=u"\nvar wiki_text = fs.readFileSync('"+bot_adress+u"bot_input.txt').toString();"
    JSLib+=u"\nwiki_text = persianWikiTools.superTool(wiki_text);"
    JSLib+=u"\nfs.writeFileSync('"+bot_adress+u"bot_result.txt', wiki_text);"

    with codecs.open(JSFile ,mode = 'w',encoding = 'utf8' ) as f:
        f.write(JSLib)
    os.system('node '+bot_adress+'fa_bot.js')
    file_text = codecs.open(BotResultFile,'r' ,'utf8' )
    file_text = file_text.read()
    return file_text

def Update_JS():
    wikipedia.output(u'\03{lightblue}------start ----\03{default}')
    JSLibrary=u'\n'
    for i in [u'مدیاویکی:Gadget-Extra-Editbuttons-persiantools.js',u'مدیاویکی:Gadget-Extra-Editbuttons-persianwikitools.js',u'مدیاویکی:Gadget-Extra-Editbuttons-dictionary.js',u'مدیاویکی:Gadget-Extra-Editbuttons-autoed.js']:
        fapage=wikipedia.Page(faSite,i)
        JSLibrary+=u'\n'+fapage.get()
    JSLibrary = re.sub(ur'mw\.config\.get\(.*?\)', u'0', JSLibrary)
    with codecs.open(bot_adress+u"JSLib.js" ,mode = 'w',encoding = 'utf8' ) as f:
        f.write(JSLibrary)
    wikipedia.output(u'\03{lightblue}'+bot_adress+u'fa_cosmetic_changes_version.txt and JSLib.js are updated\03{default}')

def main():
    Update_JS()
    wikipedia.output(u'\03{lightblue}Version '+version+u'\03{default}')
    os.system('sql fawiki_p "SELECT page_title FROM page WHERE page_namespace = 14 AND page_is_redirect = 0;" > '+bot_adress+'Title_sql_result.txt')
    text = codecs.open( bot_adress+'Title_sql_result.txt','r' ,'utf8' )
    text = text.read().replace(u'_',u' ').replace(u'\r',u'').replace(u'\n\n',u'\n').strip()
    wikipedia.output(u'\03{lightblue}-- Sql is done!\03{default}')
    our_list={}
    new_txt2,new_txt3,new_txt4,new_txt=u'\n',u'\n',u'\n',u'\n'
    wikipedia.output(u'\03{lightblue}-- compairing the lists\03{default}')
    list1=text.split(u'\n')
    count1=-1
    count2=0
    for txt in list1:
        count1+=1
        wikipedia.output( u'='+str(count1))
        text2=dictation(txt)
        text2=cleaning(text2)
        text2=text2.replace(u',',u'،').replace(u' ،',u'،').replace(u' ؛',u'؛')
        text2=text2.replace(u'  ',u' ').replace(u'  ',u' ').strip()
        text2=JS_Extratools(text2)
        text2=text2.strip()
        if text2!=txt:
            if txt in correct_pages:
                continue
            elif u'جاده ای' in txt or u'بزرگراه ام' in txt:
                continue
            elif u'–' in text2 or u'. ' in text2:
               new_txt2+=u'# [['+txt +u']]\t > \t[['+text2+u']]\n'
               count2+=1

            elif string.count(text2,u'آ')> string.count(txt,u'آ'):
               new_txt3+=u'# [['+txt +u']]\t > \t[['+text2+u']]\n'
               count2+=1

            elif u'ها' in text2 and u' ها' in txt:
               new_txt4+=u'# [['+txt +u']]\t > \t[['+text2+u']]\n'
               count2+=1

            else:
                new_txt+=u'# [['+txt +u']]\t > \t[['+text2+u']]\n'
                count2+=1
            if count2==2500:
                page_extention=u' ۱'
                fapage=wikipedia.Page(faSite,u'ویکی‌پدیا:گزارش دیتابیس/برای انتقال'+page_extention)
                put_text=u'\n== سجاوندی ==\n'+new_txt2+u'\n\n== آ ==\n'+new_txt3+u'\n\n== ها ==\n'+new_txt4+u'\n\n== سایر ==\n'+new_txt+u'\n'
                fapage.put(put_text,u'ربات:به‌روزرسانی گزارش')
                new_txt2,new_txt3,new_txt4,new_txt=u'\n',u'\n',u'\n',u'\n'
            elif count2==5000:
                page_extention=u' ۲'
                fapage=wikipedia.Page(faSite,u'ویکی‌پدیا:گزارش دیتابیس/برای انتقال'+page_extention)
                put_text=u'\n== سجاوندی ==\n'+new_txt2+u'\n\n== آ ==\n'+new_txt3+u'\n\n== ها ==\n'+new_txt4+u'\n\n== سایر ==\n'+new_txt+u'\n'
                fapage.put(put_text,u'ربات:به‌روزرسانی گزارش')
                new_txt2,new_txt3,new_txt4,new_txt=u'\n',u'\n',u'\n',u'\n'
            elif count2>7500:
                page_extention=u' ۳'
                fapage=wikipedia.Page(faSite,u'ویکی‌پدیا:گزارش دیتابیس/برای انتقال'+page_extention)
                put_text=u'\n== سجاوندی ==\n'+new_txt2+u'\n\n== آ ==\n'+new_txt3+u'\n\n== ها ==\n'+new_txt4+u'\n\n== سایر ==\n'+new_txt+u'\n'
                fapage.put(put_text,u'ربات:به‌روزرسانی گزارش')
                new_txt2,new_txt3,new_txt4,new_txt=u'\n',u'\n',u'\n',u'\n'
                break
            else:
                continue
    if new_txt2+new_txt3+new_txt4+new_txt:
        page_extention=u' ۴'
        fapage=wikipedia.Page(faSite,u'ویکی‌پدیا:گزارش دیتابیس/برای انتقال'+page_extention)
        put_text=u'\n== سجاوندی ==\n'+new_txt2+u'\n\n== آ ==\n'+new_txt3+u'\n\n== ها ==\n'+new_txt4+u'\n\n== سایر ==\n'+new_txt+u'\n'
        fapage.put(put_text,u'ربات:به‌روزرسانی گزارش')

if __name__ == "__main__":
    main()
